#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 `success`
#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```

terraform
tls_private_key.private_key: Refreshing state... [id=f0c41fccbbb36bcf4d09e0d5c1f6bb7673dce74c]
linode_nodebalancer.app_nb: Refreshing state... [id=187339]
linode_instance.db: Refreshing state... [id=33328466]
acme_registration.reg: Refreshing state... [id=https://acme-v02.api.letsencrypt.org/acme/acct/343079720]
linode_domain.domain: Refreshing state... [id=1770544]
linode_instance.app[0]: Refreshing state... [id=33328465]
linode_domain_record.rewards: Refreshing state... [id=19847441]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # linode_domain.domain has changed
  ~ resource "linode_domain" "domain" {
        id          = "1770544"
      + master_ips  = []
        tags        = [
            "fealty",
        ]
        # (8 unchanged attributes hidden)
    }

  # linode_nodebalancer.app_nb has changed
  ~ resource "linode_nodebalancer" "app_nb" {
        id                   = "187339"
        tags                 = [
            "fealty",
        ]
      ~ transfer             = [
          ~ {
              ~ in    = 0 -> 0.006840705871582031
              ~ out   = 0 -> 0.004815101623535156
              ~ total = 0 -> 0.011655807495117188
            },
        ]
        # (8 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # acme_certificate.certificate will be created
  + resource "acme_certificate" "certificate" {
      + account_key_pem               = (sensitive value)
      + certificate_domain            = (known after apply)
      + certificate_p12               = (sensitive value)
      + certificate_pem               = (known after apply)
      + certificate_url               = (known after apply)
      + common_name                   = "rewards.josh.services"
      + disable_complete_propagation  = false
      + id                            = (known after apply)
      + issuer_pem                    = (known after apply)
      + key_type                      = "4096"
      + min_days_remaining            = 30
      + must_staple                   = false
      + pre_check_delay               = 60
      + private_key_pem               = (sensitive value)
      + revoke_certificate_on_destroy = false

      + dns_challenge {
          + config   = (sensitive value)
          + provider = "linode"
        }
    }

  # linode_instance.app[0] must be replaced
-/+ resource "linode_instance" "app" {
      ~ backups            = [
          - {
              - enabled  = true
              - schedule = [
                  - {
                      - day    = "Scheduling"
                      - window = "Scheduling"
                    },
                ]
            },
        ] -> (known after apply)
      ~ boot_config_label  = "My fealty-app Profile" -> (known after apply)
      ~ id                 = "33328465" -> (known after apply)
      ~ image              = "private/15089218" -> "dummy" # forces replacement
      ~ ip_address         = "170.187.152.75" -> (known after apply)
      ~ ipv4               = [
          - "170.187.152.75",
          - "192.168.172.94",
        ] -> (known after apply)
      ~ ipv6               = "2600:3c02::f03c:92ff:fea4:2173/128" -> (known after apply)
      ~ private_ip_address = "192.168.172.94" -> (known after apply)
      ~ specs              = [
          - {
              - disk     = 25600
              - memory   = 1024
              - transfer = 1000
              - vcpus    = 1
            },
        ] -> (known after apply)
      ~ status             = "running" -> (known after apply)
      ~ swap_size          = 512 -> (known after apply)
        tags               = [
            "fealty",
        ]
        # (7 unchanged attributes hidden)

      ~ alerts {
          ~ cpu            = 90 -> (known after apply)
          ~ io             = 10000 -> (known after apply)
          ~ network_in     = 10 -> (known after apply)
          ~ network_out    = 10 -> (known after apply)
          ~ transfer_quota = 80 -> (known after apply)
        }

      - config {
          - kernel       = "linode/latest-64bit" -> null
          - label        = "My fealty-app Profile" -> null
          - memory_limit = 0 -> null
          - root_device  = "/dev/sda" -> null
          - run_level    = "default" -> null
          - virt_mode    = "paravirt" -> null

          - devices {
              - sda {
                  - disk_id    = 67124821 -> null
                  - disk_label = "fealty-app" -> null
                  - volume_id  = 0 -> null
                }

              - sdb {
                  - disk_id    = 67124822 -> null
                  - disk_label = "512 MB Swap Image" -> null
                  - volume_id  = 0 -> null
                }
            }

          - helpers {
              - devtmpfs_automount = true -> null
              - distro             = true -> null
              - modules_dep        = true -> null
              - network            = true -> null
              - updatedb_disabled  = true -> null
            }

          - interface {
              - ipam_address = "10.10.10.2/24" -> null
              - label        = "fealty-vlan" -> null
              - purpose      = "vlan" -> null
            }
        }

      - disk {
          - authorized_keys  = [] -> null
          - authorized_users = [] -> null
          - filesystem       = "ext4" -> null
          - id               = 67124821 -> null
          - label            = "fealty-app" -> null
          - read_only        = false -> null
          - size             = 25088 -> null
          - stackscript_data = (sensitive value)
          - stackscript_id   = 0 -> null
        }
      - disk {
          - authorized_keys  = [] -> null
          - authorized_users = [] -> null
          - filesystem       = "swap" -> null
          - id               = 67124822 -> null
          - label            = "512 MB Swap Image" -> null
          - read_only        = false -> null
          - size             = 512 -> null
          - stackscript_data = (sensitive value)
          - stackscript_id   = 0 -> null
        }

        # (1 unchanged block hidden)
    }

  # linode_instance.db must be replaced
-/+ resource "linode_instance" "db" {
      ~ backups            = [
          - {
              - enabled  = true
              - schedule = [
                  - {
                      - day    = "Scheduling"
                      - window = "Scheduling"
                    },
                ]
            },
        ] -> (known after apply)
      ~ boot_config_label  = "My fealty-db Profile" -> (known after apply)
      ~ id                 = "33328466" -> (known after apply)
      ~ image              = "private/15089216" -> "dummy" # forces replacement
      ~ ip_address         = "170.187.152.78" -> (known after apply)
      ~ ipv4               = [
          - "170.187.152.78",
        ] -> (known after apply)
      ~ ipv6               = "2600:3c02::f03c:92ff:fea4:2152/128" -> (known after apply)
      - private_ip         = false -> null
      + private_ip_address = (known after apply)
      ~ specs              = [
          - {
              - disk     = 25600
              - memory   = 1024
              - transfer = 1000
              - vcpus    = 1
            },
        ] -> (known after apply)
      ~ status             = "running" -> (known after apply)
      ~ swap_size          = 512 -> (known after apply)
        tags               = [
            "fealty",
        ]
        # (6 unchanged attributes hidden)

      ~ alerts {
          ~ cpu            = 90 -> (known after apply)
          ~ io             = 10000 -> (known after apply)
          ~ network_in     = 10 -> (known after apply)
          ~ network_out    = 10 -> (known after apply)
          ~ transfer_quota = 80 -> (known after apply)
        }

      - config {
          - kernel       = "linode/latest-64bit" -> null
          - label        = "My fealty-db Profile" -> null
          - memory_limit = 0 -> null
          - root_device  = "/dev/sda" -> null
          - run_level    = "default" -> null
          - virt_mode    = "paravirt" -> null

          - devices {
              - sda {
                  - disk_id    = 67124823 -> null
                  - disk_label = "fealty-db" -> null
                  - volume_id  = 0 -> null
                }

              - sdb {
                  - disk_id    = 67124824 -> null
                  - disk_label = "512 MB Swap Image" -> null
                  - volume_id  = 0 -> null
                }
            }

          - helpers {
              - devtmpfs_automount = true -> null
              - distro             = true -> null
              - modules_dep        = true -> null
              - network            = true -> null
              - updatedb_disabled  = true -> null
            }

          - interface {
              - ipam_address = "10.10.10.3/24" -> null
              - label        = "fealty-vlan" -> null
              - purpose      = "vlan" -> null
            }
        }

      - disk {
          - authorized_keys  = [] -> null
          - authorized_users = [] -> null
          - filesystem       = "ext4" -> null
          - id               = 67124823 -> null
          - label            = "fealty-db" -> null
          - read_only        = false -> null
          - size             = 25088 -> null
          - stackscript_data = (sensitive value)
          - stackscript_id   = 0 -> null
        }
      - disk {
          - authorized_keys  = [] -> null
          - authorized_users = [] -> null
          - filesystem       = "swap" -> null
          - id               = 67124824 -> null
          - label            = "512 MB Swap Image" -> null
          - read_only        = false -> null
          - size             = 512 -> null
          - stackscript_data = (sensitive value)
          - stackscript_id   = 0 -> null
        }

        # (1 unchanged block hidden)
    }

  # linode_nodebalancer_config.app_nb_config will be created
  + resource "linode_nodebalancer_config" "app_nb_config" {
      + algorithm       = "source"
      + check           = "http"
      + check_attempts  = 3
      + check_body      = (known after apply)
      + check_interval  = 30
      + check_passive   = (known after apply)
      + check_path      = "/healthz"
      + check_timeout   = 5
      + cipher_suite    = "recommended"
      + id              = (known after apply)
      + node_status     = (known after apply)
      + nodebalancer_id = 187339
      + port            = 443
      + protocol        = "https"
      + proxy_protocol  = "none"
      + ssl_cert        = (sensitive value)
      + ssl_commonname  = (known after apply)
      + ssl_fingerprint = (known after apply)
      + ssl_key         = (sensitive value)
      + stickiness      = "http_cookie"
    }

  # linode_nodebalancer_node.app_nb_node[0] will be created
  + resource "linode_nodebalancer_node" "app_nb_node" {
      + address         = (known after apply)
      + config_id       = (known after apply)
      + id              = (known after apply)
      + label           = "app-node-1"
      + mode            = "accept"
      + nodebalancer_id = 187339
      + status          = (known after apply)
      + weight          = (known after apply)
    }

Plan: 5 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @biodrone, Action: `pull_request`, Working Directory: `deploy`, Workflow: `CI`*